# Rank Series with `.rank()`

### Import Pandas

In [1]:
import pandas as pd

### Read CSV

In [2]:
salaries = pd.read_csv("mls_salaries.csv")

### No NaNs Allowed
To use the `rank()` method we will need to do some cleaning to remove all NaN values or the `rank()` method won't work.

In [3]:
salaries.dropna(subset=["club","base_salary","first_name","position"], inplace=True)
salaries.dropna(how="all", inplace=True)
salaries

    club last_name first_name position  base_salary  guaranteed_compensation
0    ATL   Almiron     Miguel        M    1912500.0               2297000.00
1    ATL   Ambrose      Mikey        D      65625.0                 65625.00
2    ATL      Asad      Yamil        M     150000.0                150000.00
3    ATL     Bloom       Mark        D      99225.0                106573.89
4    ATL  Carleton     Andrew        F      65000.0                 77400.00
..   ...       ...        ...      ...          ...                      ...
609  VAN   Techera   Cristian        M     352000.0                377000.00
610  VAN   Teibert    Russell        M     126500.0                194000.00
611  VAN  Tornaghi      Paolo       GK      80000.0                 80000.00
612  VAN    Waston    Kendall        D     350000.0                368125.00
614  VAN  Williams    Sheanon        D     175000.0                184000.00

[600 rows x 6 columns]

### Rank by base_salary

Now we can rank the base_column using the .rank() method and chaining the astype("int") method to convert to datatype from float to int.

In [4]:
# rank
salaries["base_salary"].rank().astype("int")

0      589
1      142
2      348
3      236
4       82
      ...
609    504
610    309
611    200
612    498
614    377
Name: base_salary, Length: 600, dtype: int64

### Create new column named ranked_salary
Create a new column named ranked_salary.

In [7]:
salaries['ranked_salary'] = salaries['base_salary'].rank().astype("int")
salaries['ranked_salary']

0      589
1      142
2      348
3      236
4       82
      ...
609    504
610    309
611    200
612    498
614    377
Name: ranked_salary, Length: 600, dtype: int64

Better yet, let's change the sorting direction while we're at it.

In [8]:
# change direction with ascending=False
salaries['ranked_salary'] = salaries['base_salary'].rank(ascending=False).astype("int")

Finally, if we use the `sort_values()` method, descending, we will see the highest paid players ranked first.

In [19]:
# sort base_salary in reverse, showing the highest salary as number 1
salaries.sort_values("base_salary", ascending=False)

,club,last_name,first_name,position,base_salary,guaranteed_compensation,ranked_salary
560,TOR,Bradley,Michael,M,6000000.00,6500000.00,1
355,NYCFC,Villa,David,F,5610000.00,5610000.00,2
349,NYCFC,Pirlo,Andrea,M,5600000.00,5915690.00,3
568,TOR,Giovinco,Sebastian,F,5600000.00,7115555.67,3
55,CHI,Schweinsteiger,Bastian,M,5400000.00,5400000.00,5
...,...,...,...,...,...,...,...
366,NYRB,Etienne,Derrick,M,53000.00,58000.00,593
138,DAL,Reynolds,Bryan,F,53000.00,55000.00,593
462,POR,McIntosh,Kendall,GK,53000.00,53000.00,593
348,NYCFC,Okoli,Sean,F,52999.92,52999.92,599
523,SEA,Tolo,Nouhou,D,52999.92,52999.92,599